<a href="https://colab.research.google.com/github/asifjahan1/Employees-csv/blob/main/Lab_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import sklearn
from sklearn.datasets import load_boston

In [ ]:
data = pd.read_csv("employees.csv")

In [ ]:
bool_series = pd.isnull(data["Gender"])

In [ ]:
data[bool_series]

    First Name Gender  ... Senior Management                  Team
20        Lois    NaN  ...              True                 Legal
22      Joshua    NaN  ...              True       Client Services
27       Scott    NaN  ...             False                 Legal
31       Joyce    NaN  ...             False               Product
41   Christine    NaN  ...              True  Business Development
..         ...    ...  ...               ...                   ...
961    Antonio    NaN  ...             False                 Legal
972     Victor    NaN  ...              True                 Sales
985    Stephen    NaN  ...             False                 Legal
989     Justin    NaN  ...             False                 Legal
995      Henry    NaN  ...             False          Distribution

[145 rows x 8 columns]

In [ ]:
# Answer to the question No. 1
data.replace(to_replace = np.nan, value = -99)

    First Name  Gender  ... Senior Management                  Team
0      Douglas    Male  ...              True             Marketing
1       Thomas    Male  ...              True                   -99
2        Maria  Female  ...             False               Finance
3        Jerry    Male  ...              True               Finance
4        Larry    Male  ...              True       Client Services
..         ...     ...  ...               ...                   ...
995      Henry     -99  ...             False          Distribution
996    Phillip    Male  ...             False               Finance
997    Russell    Male  ...             False               Product
998      Larry    Male  ...             False  Business Development
999     Albert    Male  ...              True                 Sales

[1000 rows x 8 columns]

In [ ]:
new_data = data.dropna(axis = 0, how ='any')
new_data

    First Name  Gender  ... Senior Management                  Team
0      Douglas    Male  ...              True             Marketing
2        Maria  Female  ...             False               Finance
3        Jerry    Male  ...              True               Finance
4        Larry    Male  ...              True       Client Services
5       Dennis    Male  ...             False                 Legal
..         ...     ...  ...               ...                   ...
994     George    Male  ...              True             Marketing
996    Phillip    Male  ...             False               Finance
997    Russell    Male  ...             False               Product
998      Larry    Male  ...             False  Business Development
999     Albert    Male  ...              True                 Sales

[764 rows x 8 columns]

In [ ]:
# Answer to the Question No. 2
data.sort_values("First Name", inplace = True)

In [ ]:
bool_series = data["First Name"].duplicated(keep = False)

In [ ]:
data.head()

    First Name Gender Start Date  ... Bonus %  Senior Management             Team
101      Aaron   Male  2/17/2012  ...  11.849               True        Marketing
327      Aaron   Male  1/29/1994  ...   5.097               True        Marketing
440      Aaron   Male  7/22/1990  ...  11.343               True  Client Services
937      Aaron    NaN  1/22/1986  ...  18.424              False  Client Services
137       Adam   Male  5/21/2011  ...  15.120              False     Distribution

[5 rows x 8 columns]

In [ ]:
data[bool_series]

    First Name  Gender Start Date  ... Bonus %  Senior Management             Team
101      Aaron    Male  2/17/2012  ...  11.849               True        Marketing
327      Aaron    Male  1/29/1994  ...   5.097               True        Marketing
440      Aaron    Male  7/22/1990  ...  11.343               True  Client Services
937      Aaron     NaN  1/22/1986  ...  18.424              False  Client Services
137       Adam    Male  5/21/2011  ...  15.120              False     Distribution
..         ...     ...        ...  ...     ...                ...              ...
902        NaN    Male  5/23/2001  ...   6.322                NaN     Distribution
925        NaN  Female  8/23/2000  ...  19.388                NaN            Sales
946        NaN  Female  9/15/1985  ...  16.941                NaN     Distribution
947        NaN    Male  7/30/2012  ...   5.329                NaN        Marketing
951        NaN  Female  9/14/2010  ...   9.662                NaN              NaN

[991 rows x 8 columns]

In [ ]:
bool_series

101    True
327    True
440    True
937    True
137    True
       ...
902    True
925    True
946    True
947    True
951    True
Name: First Name, Length: 1000, dtype: bool

In [ ]:
data = data[~bool_series]

In [ ]:
data.info()
data

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9 entries, 8 to 291
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         9 non-null      object
 1   Gender             9 non-null      object
 2   Start Date         9 non-null      object
 3   Last Login Time    9 non-null      object
 4   Salary             9 non-null      int64
 5   Bonus %            9 non-null      float64
 6   Senior Management  9 non-null      object
 7   Team               9 non-null      object
dtypes: float64(1), int64(1), object(6)
memory usage: 648.0+ bytes

    First Name  Gender  ... Senior Management                  Team
8       Angela  Female  ...              True           Engineering
688      Brian    Male  ...              True                 Legal
190      Carol  Female  ...             False               Finance
887      David    Male  ...             False                 Legal
5       Dennis    Male  ...             False                 Legal
495     Eugene    Male  ...             False                 Sales
33        Jean  Female  ...             False  Business Development
832      Keith    Male  ...             False                 Legal
291      Tammy  Female  ...              True       Client Services

[9 rows x 8 columns]

In [ ]:
# Answer to the Question No 3(a)
# create DataFrame
df = pd.DataFrame(data)

In [ ]:
print (df[['First Name', 'Team']])

    First Name                  Team
8       Angela           Engineering
688      Brian                 Legal
190      Carol               Finance
887      David                 Legal
5       Dennis                 Legal
495     Eugene                 Sales
33        Jean  Business Development
832      Keith                 Legal
291      Tammy       Client Services

In [ ]:
df_min_max_scaled = df.copy()

In [ ]:
for column in df_min_max_scaled.columns:
    df_min_max_scaled[column] = (df_min_max_scaled[column] - df_min_max_scaled[column].min()) / (df_min_max_scaled[column].max() - df_min_max_scaled[column].min())

In [ ]:
# Load the dataset
df = load_boston()

# Create the dataframe
column_name = df.feature_names
df_boston = pd.DataFrame(df.data)
df_boston.columns = column_name
df_boston.head()

Q1 = np.percentile(df_boston['DIS'], 25,
                   interpolation = 'midpoint')

Q3 = np.percentile(df_boston['DIS'], 75,
                   interpolation = 'midpoint')
IQR = Q3 - Q1

print("Old Shape: ", df_boston.shape)

upper = np.where(df_boston['DIS'] >= (Q3+1.5*IQR))
lower = np.where(df_boston['DIS'] <= (Q1-1.5*IQR))

# Removing the Outliers
df_boston.drop(upper[0], inplace = True)
df_boston.drop(lower[0], inplace = True)

print("New Shape: ", df_boston.shape)

Old Shape:  (506, 13)
New Shape:  (501, 13)